Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: If a target was included in the :keyword:`with` statement, the return value from :meth:`__enter__` is assigned to it.
ru: Если присутствует цель назначения («:token:`target`») , то возвращаемое от «:meth:`__enter__`» значение назначается этой цели.

source: The :keyword:`with` statement guarantees that if the :meth:`__enter__` method returns without an error, then :meth:`__exit__` will always be called. Thus, if an error occurs during the assignment to the target list, it will be treated the same as an error occurring within the suite would be. See step 6 below.
ru: Инструкция «:keyword:`with`» гарантирует, что если метод «:meth:`__enter__`» выполняется без ошибки, то обязательно будет вызван «:meth:`__exit__`» . Таким образом, если ошибка происходит в течение назначения списку целей, то на этом этапе она уже́ будет воспринята как ошибка внутри блока «:keyword:`with`» . Смотрите шаг 6 ниже.

source: The suite is executed.
ru: Исполняется блок кода.

source: The context manager's :meth:`__exit__` method is invoked. If an exception caused the suite to be exited, its type, value, and traceback are passed as arguments to :meth:`__exit__`. Otherwise, three :const:`None` arguments are supplied.
ru: Вызывается метод «:meth:`__exit__`» менеджера контекста. Если какое-либо исключение приводит к выходу из блока, то тип, значение и стек вызовов этого исключения передаются в качестве аргументов в «:meth:`__exit__`» – иначе передаются три аргумента «:const:`None`» .

source: If the suite was exited due to an exception, and the return value from the :meth:`__exit__` method was false, the exception is reraised. If the return value was true, the exception is suppressed, and execution continues with the statement following the :keyword:`with` statement.
ru: Если выход из блока был из-за исключения, и возвращённое методом «:meth:`__exit__`» значение было “ложь” , то это исключение перевызывается. Если же возвращённое значение было “истина” , то это исключение отменяется, и исполнение продолжается с инструкции следующей за блоком инструкции «:keyword:`with`» .

source: If the suite was exited for any reason other than an exception, the return value from :meth:`__exit__` is ignored, and execution proceeds at the normal location for the kind of exit that was taken.
ru: Если выход из блока был по любой другой причине, то возвращённое методом «:meth:`__exit__`» значение игнорируется, и исполнение продолжается обычным образом.

source: With more than one item, the context managers are processed as if multiple :keyword:`with` statements were nested::
ru: Если у «:keyword:`with`» более одного элемента, то это обрабатывается как если бы соответствующие блоки находились один внутри другого ::

source: is equivalent to ::
ru: является эквивалентом ::

source: See also
ru: Смотрите также

source: The specification, background, and examples for the Python :keyword:`with` statement.
ru: Спецификация, объяснения и примеры по Питоновской инструкции «:keyword:`with`» .

source: Function definitions
ru: Задание функций

source: A function definition defines a user-defined function object (see section :ref:`types`):
ru: Код, задающий функцию, создаёт объект пользовательской функции (смотри́те раздел “Иерархия стандартных типов” :ref:`types` ) :

source: A function definition is an executable statement. Its execution binds the function name in the current local namespace to a function object (a wrapper around the executable code for the function). This function object contains a reference to the current global namespace as the global namespace to be used when the function is called.
ru: Код, задающий функцию, является исполнимой инструкцией. Его исполнение связывает заданное имя в текущей локальной области имён с объектом функции (в котором содержится исполнимый код функции) . Этот объект функции содержит ссылку на текущую глобальную область имён, и она будет использоваться в качестве глобальной во время вызова этой функции.

source: The function definition does not execute the function body; this gets executed only when the function is called. [#]_
ru: Код, задающий функцию, не исполняет тело этой функции – оно будет исполняться, когда функция будет вызвана. [#]_ Запись текстовой константы, идущая как первая инструкция внутри тела функции, преобразуется в атрибут «:attr:`__doc__`» этой функции и таким образом становится текстом документации этой функции.

source: A function definition may be wrapped by one or more :term:`decorator` expressions. Decorator expressions are evaluated when the function is defined, in the scope that contains the function definition. The result must be a callable, which is invoked with the function object as the only argument. The returned value is bound to the function name instead of the function object. Multiple decorators are applied in nested fashion. For example, the following code ::
ru: Код, задающий функцию, может подвергаться действию одного или нескольких выражений “декораторов” (:term:`decorator`) . “Декоратор” исполняется после того, как соответствующая функция уже́ определена, в той же области видимости, в которой содержится код, задающий эту функцию. Результат исполнения выражения “декоратора” должен быть вызываемым объектом, который вызывается, с данной функцией в качестве единственного аргумента. Возвращаемый объект назначается имени данной функции вместо прежнего объекта-функции. Множественные “декораторы” применяются поочерёдно, в порядке близости к функции (в стиле вложенности) . Например, следующий код

source: **Default parameter values are evaluated when the function definition is executed.** This means that the expression is evaluated once, when the function is defined, and that that same "pre-computed" value is used for each call. This is especially important to understand when a default parameter is a mutable object, such as a list or a dictionary: if the function modifies the object (e.g. by appending an item to a list), the default value is in effect modified. This is generally not what was intended. A way around this is to use ``None`` as the default, and explicitly test for it in the body of the function, e.g.::
ru: ** Значения параметров по-умолчанию вычисляются, когда исполняется определение функции.** Это означает, что выражение вычисляется один раз, когда функция определяется, и одно и то же “предварительно вычисленное” значение используется для каждого вызова. Это особенно важно понять, когда параметр по-умолчанию является изменяемым объектом (например списком или словарём) : если функция изменяет этот объект (например, путем добавления элемента в список) , то это значение по-умолчанию останется изменённым. Как правило, это не то, что было задумано. Способом обойти это является использование «:const:`None`» в качестве значения по-умолчанию, и явная проверка этого параметра в теле функции, например: ::

source: Function call semantics are described in more detail in section :ref:`calls`. A function call always assigns values to all parameters mentioned in the parameter list, either from position arguments, from keyword arguments, or from default values. If the form "``*identifier``" is present, it is initialized to a tuple receiving any excess positional parameters, defaulting to the empty tuple. If the form "``**identifier``" is present, it is initialized to a new dictionary receiving any excess keyword arguments, defaulting to a new empty dictionary. Parameters after "``*``" or "``*identifier``" are keyword-only parameters and may only be passed used keyword arguments.
ru: Семантика вызова функции описана более подробно в разделе «:ref:`calls`» . Вызов функции всегда присваивает значения всем параметрам, упомянутым в списке параметров в определении, либо от переданных позиционных аргументов, либо от переданных именованных аргументов, либо от значений по умолчанию. Если присутствует форма “``*identifier``” , то она инициализируется кортежем, содержащим все лишние позиционные параметры, а при отсутствии таковых – пустым кортежем. Если присутствует форма “``**identifier``” , то она инициализируется новый словарём, содержащим все лишние именованные аргументы, а при отсутствии таковых – новым пустым словарём. Параметры после “``*``” или “``*identifier``” могут быть только именованными параметрами и могут быть переданы только через именованные параметры.

source: Parameters may have annotations of the form "``: expression``" following the parameter name. Any parameter may have an annotation even those of the form ``*identifier`` or ``**identifier``. Functions may have "return" annotation of the form "``-> expression``" after the parameter list. These annotations can be any valid Python expression and are evaluated when the function definition is executed. Annotations may be evaluated in a different order than they appear in the source code. The presence of annotations does not change the semantics of a function. The annotation values are available as values of a dictionary keyed by the parameters' names in the :attr:`__annotations__` attribute of the function object.
ru: Параметры могут иметь описания в форме “``: expression``” после имени параметра. Любой параметр может иметь описание, даже те, которые в форме “``*identifier``” или “``**identifier``” . Функции могут иметь описание возвращаемого результата в форме “``-> expression``” в позиции после списка параметров. Эти описания могут быть любыми допустимыми выражениями Питона, они вычисляются при исполнении определения функции. Описания могут быть вычислены в другом порядке, чем они появляются в исходном коде. Наличие описаний не меняет семантику функции. Значения описаний доступны в виде значений словаря в атрибуте «:attr:`__annotations__`» данной функции, с именем нужного параметра в качестве ключа.

source: It is also possible to create anonymous functions (functions not bound to a name), for immediate use in expressions. This uses lambda forms, described in section :ref:`lambda`. Note that the lambda form is merely a shorthand for a simplified function definition; a function defined in a ":keyword:`def`" statement can be passed around or assigned to another name just like a function defined by a lambda form. The ":keyword:`def`" form is actually more powerful since it allows the execution of multiple statements and annotations.
ru: Кроме того, можно создавать анонимные функции (функции, не связанные с именем), для непосредственного использования по месту создания внутри выражения. Для этого используются ламбда-формы – это практически синоним понятия “упрощенное определение функции” – их описание в разделе Ламбды. Функцию, определенную инструкцией «:keyword:`def`» можно передавать или назначать другому имени так же, как и функцию, определенную ламбда-формой. Форма «:keyword:`def`» вообще-то имеет больше возможностей, например, позволяет выполнять несколько инструкций и иметь описания.

source: **Programmer's note:** Functions are first-class objects. A "``def``" form executed inside a function definition defines a local function that can be returned or passed around. Free variables used in the nested function can access the local variables of the function containing the def. See section :ref:`naming` for details.
ru: **Замечание:** Функции являются объектами первого класса. Форма «:keyword:`def`» выполняемая внутри определения другой функции – создаёт локальную функцию, которая может быть внешнею функцией возвращена в качестве результата или передана куда-либо. Свободные имена, используемые во вложенной функции, могут указывать на локальные переменные внешней функции. Смотрите детали в разделе “:ref:`naming`” .

source: A class definition is an executable statement. It first evaluates the inheritance list, if present. Each item in the inheritance list should evaluate to a class object or class type which allows subclassing. The class's suite is then executed in a new execution frame (see section :ref:`naming`), using a newly created local namespace and the original global namespace. (Usually, the suite contains only function definitions.) When the class's suite finishes execution, its execution frame is discarded but its local namespace is saved. [#]_ A class object is then created using the inheritance list for the base classes and the saved local namespace for the attribute dictionary. The class name is bound to this class object in the original local namespace.
ru: Код, задающий класс (“определение” класса) , является исполнимой инструкцией. Сначала, если имеется, вычисляется список наследуемых базовых классов. Каждый элемент в этом списке должен давать в результате объект-класс, такой, который допускает создание производного класса. Затем основной класс исполняется в новом кадре исполнения (смотри́те раздел :ref:`naming` ) с использованием новосозданной локальной области имён и исходной глобальной области имён. (Обычно код класса содержит только “определения” функций. ) Текстовый объект, идущий с первой строки содержания кода класса, преобразуется в элемент с именем “``__doc__``” в данной локальной области и, таким образом становится “документацией” этого класса. [#]_ Когда код класса завершён, его кадр исполнения удаляется, а его локальная область имён сохраняется. Затем создаётся объект-класс с использованием списка наследования для базовых классов, а полученная ранее область имён становится словарём атрибутов класса. Затем полученный объект-класс назначается указанному имени в исходной области имён.

source: Classes can also be decorated; as with functions, ::
ru: Классы могут быть “декорированы” , таким же образом как и функции: ::

source: **Programmer's note:** Variables defined in the class definition are class variables; they are shared by instances. Instance variables can be set in a method with ``self.name = value``. Both class and instance variables are accessible through the notation "``self.name``", and an instance variable hides a class variable with the same name when accessed in this way. Class variables can be used as defaults for instance variables, but using mutable values there can lead to unexpected results. Descriptors can be used to create instance variables with different implementation details.
ru: **Замечание:** Переменные, созданные в “определении” класса становятся атрибутами класса, общими для всех его экземпляров. Атрибуты экземпляра могут быть созданы из какого-либо метода посредством «``self.name = значение``» . Атрибуты и класса и экземпляра доступны через формулировку «``self.name``» , и при таком способе доступа атрибут экземпляра перекрывает атрибут класса с тем же именем. Атрибуты класса могут использоваться как значения по умолчанию для атрибутов экземпляра, но если эти атрибуты класса являются изменяемыми – то это может привести к неожиданным результатам. Для создания у экземпляра переменных с нестандартными деталями реализации – можно использовать дескрипторы.

source: :pep:`3129` - Class Decorators
ru: :pep:`3129` - “Декораторы” классов

source: Class definitions, like function definitions, may be wrapped by one or more :term:`decorator` expressions. The evaluation rules for the decorator expressions are the same as for functions. The result must be a class object, which is then bound to the class name.
ru: “Определение” класса (так же как и функции) , может подвергаться действию одного или нескольких выражений :term:`“декораторов”<decorator>` . Правила исполнения :term:`“декораторов”<decorator>` такие же, как и для функций. Результат исполнения выражения :term:`“декоратора”<decorator>` должен быть объектом-классом, который затем назначается имени данного класса вместо прежнего класса.

source: Footnotes
ru: Сноски

source: The exception is propagated to the invocation stack only if there is no :keyword:`finally` clause that negates the exception.
ru: Исключение передаётся вверх по стеку вызовов только если отсутствует блок «:keyword:`finally`» , такой, который нейтрализует данное исключение.

source: A string literal appearing as the first statement in the function body is transformed into the function's ``__doc__`` attribute and therefore the function's :term:`docstring`.
ru: Запись текстовой константы, идущая как первая инструкция внутри тела функции, преобразуется в атрибут «``__doc__``» этой функции и таким образом становится текстом :term:`“документации”<docstring>` этой функции.

source: A string literal appearing as the first statement in the class body is transformed into the namespace's ``__doc__`` item and therefore the class's :term:`docstring`.
ru: Текстовый объект, идущий с первой строки содержания кода класса, преобразуется в элемент с именем “``__doc__``” в данной локальной области и, таким образом, становится :term:`“документацией”<docstring>` этого класса.

source: Data model
ru: Модель данных

source: Objects, values and types
ru: Объекты, значения и типы

source: :dfn:`Objects` are Python's abstraction for data. All data in a Python program is represented by objects or by relations between objects. (In a sense, and in conformance to Von Neumann's model of a "stored program computer," code is also represented by objects.)
ru: Объекты в Питоне являются абстракцией для данных. Все данные в программе на Питоне представлены объектами или взаимоотношениями между объектами. (А с точки зрения Фон Неймановской модели «хранимых в памяти программ» , код также представляется объектами.)

source: Every object has an identity, a type and a value. An object's *identity* never changes once it has been created; you may think of it as the object's address in memory. The ':keyword:`is`' operator compares the identity of two objects; the :func:`id` function returns an integer representing its identity (currently implemented as its address). An object's :dfn:`type` is also unchangeable. [#]_ An object's type determines the operations that the object supports (e.g., "does it have a length?") and also defines the possible values for objects of that type. The :func:`type` function returns an object's type (which is an object itself). The *value* of some objects can change. Objects whose value can change are said to be *mutable*; objects whose value is unchangeable once they are created are called *immutable*. (The value of an immutable container object that contains a reference to a mutable object can change when the latter's value is changed; however the container is still considered immutable, because the collection of objects it contains cannot be changed. So, immutability is not strictly the same as having an unchangeable value, it is more subtle.) An object's mutability is determined by its type; for instance, numbers, strings and tuples are immutable, while dictionaries and lists are mutable.
ru: Каждый объект имеет идентификатор, тип и значение. *Идентификатор* объекта никогда не изменяется после создания объекта, его можно представить себе как адрес объекта в памяти. Оператор «:keyword:`is`» сравнивает идентификаторы двух объектов; функция «:func:`id`» возвращает целое число, представляющее идентификатор (на текущий момент реализованный как адрес объекта). Тип объекта также является неизменяемым. [#]_ Тип объекта определяет операции, поддерживаемые объектом (например, имеет ли объект длину), а также возможные значения для объекта этого типа. Функция «:func:`type`» возвращает тип объекта (тип, в свою очередь, как и любые данные, является объектом). *Значение* некоторых объектов может меняться. Объекты, значение которых может меняться с сохранением того же идентификатора, называются *изменяемыми*; объекты, значение которых после их создания не может быть изменено так, чтобы идентификатор остался неизменным, называются *неизменяемыми*. (В некотором смысле значение неизменяемого объекта-контейнера, который содержит ссылки на изменяемые объекты, может виртуально меняться, когда значение последних изменено, тем не менее сам контейнер рассматривается как неизменяемый, потому что набор содержащихся в нем объектов не может быть изменен. Таким образом, неизменяемость *объекта* не подразумевает неизменяемость *результата* вычисления (интерпретирования) этого объекта.) Изменяемость объекта определяется его типом, например: числа, текстовые данные и кортежи неизменяемы, тогда как словари и списки изменяемы.

source: Objects are never explicitly destroyed; however, when they become unreachable they may be garbage-collected. An implementation is allowed to postpone garbage collection or omit it altogether --- it is a matter of implementation quality how garbage collection is implemented, as long as no objects are collected that are still reachable.
ru: Объекты никогда явным образом не уничтожаются, тем не менее, когда они становятся недоступны они могут быть обработаны “сборщиком мусора” . В реализациях допустимы также отложенная “сборка мусора” или полное ее отсутствие. Каким образом реализована сборка мусора - это вопрос качества реализации, но при обязательном условии, что объекты, которые все еще доступны, не будут собраны “сборщиком мусора” .

source: CPython currently uses a reference-counting scheme with (optional) delayed detection of cyclically linked garbage, which collects most objects as soon as they become unreachable, but is not guaranteed to collect garbage containing circular references. See the documentation of the :mod:`gc` module for information on controlling the collection of cyclic garbage. Other implementations act differently and CPython may change.
ru: В настоящее время “CPython” использует схему подсчёта ссылок с (опционально) отсрочкой определения циклически связанного “мусора” , которая собирает большинство объектов, как только они становятся недоступными, но не гарантируется сборка мусора, содержащего циклические ссылки. Смотрите документацию модуля «:mod:`gc`», чтобы узнать о контроле сбора циклического мусора.

source: Note that the use of the implementation's tracing or debugging facilities may keep objects alive that would normally be collectable. Also note that catching an exception with a ':keyword:`try`...\ :keyword:`except`' statement may keep objects alive.
ru: Обратите внимание, что в данной реализации использование трассировки или отладки может сохранить объекты, которые в норме были бы “собраны” . Отметьте также, что перехват исключения в выражении «:keyword:`try`...\ :keyword:`except`» может сохранить объекты.

source: Some objects contain references to "external" resources such as open files or windows. It is understood that these resources are freed when the object is garbage-collected, but since garbage collection is not guaranteed to happen, such objects also provide an explicit way to release the external resource, usually a :meth:`close` method. Programs are strongly recommended to explicitly close such objects. The ':keyword:`try`...\ :keyword:`finally`' statement and the ':keyword:`with`' statement provide convenient ways to do this.
ru: Некоторые объекты содержат ссылки на “внешние” ресурсы, такие как открытые файлы или “окна” . Понятно что эти ресурсы освобождаются при сборке мусора, однако поскольку не гарантировано что “сбор мусора” произойдет, то такие объекты также предоставляют явный способ освобождения таких внешних ресурсов – как правило это метод :meth:`close` . В программах настоятельно рекомендуется закрывать такие объекты явно. Для этого удобно использовать конструкции «:keyword:`try`...\ :keyword:`finally`» и «:keyword:`with`» .
